# -*- coding: utf-8 -*-
# lesson 3.1: experiment for talking in Slack
'''
http://python.stepic.org
О том, как работать и как использовать Slack можно почитать здесь: https://get.slack.help/hc/en-us
Мы не ограничиваем тематику и стиль общения, однако, предлагаем несколько правил:

1.       Просим не выкладывать решения на задания курса, чтобы не мешать другим прийти к ним самостоятельно.

2.       Преподаватели курса могут принимать участие в общении, но все вопросы и пожелания для них оставляйте по-прежнему в комментариях на Stepic.org.

3.       Учитывайте, что история ваших диалогов пропадает после того, как в чате суммарно наберётся 10000 сообщений (т.е. довольно быстро).

4.       Будьте вежливы и приветливы ко всем!


Мы не будем специально модерировать чаты, но если заметим случаи выкладывания ответов/решений в публичный доступ, забаним пользователя (и его прогресс, соответственно) на платформе.
'''